import { faEarthAmerica, faFlask, faLightbulb, faUserDoctor } from "@fortawesome/free-solid-svg-icons";
import { IForWhom } from "./types";

export const forWhomData: IForWhom[] = [
  {
    title: "Туризм мамандары",
    text: "Күн сайын көп тілді қызмет көрсету ортасында жұмыс істей отырып, қонақ үй қызметкерлері біздің мамандандырылған оқыту жүйемізбен ағылшын тілін және тиісті терминологияны сапалы меңгеруін қамтамасыз етеміз.",
    icon: faEarthAmerica,
    iconColor: "#1CAC78",
    bgColor: "#D5E9F6"
  },
  {
    title: "Білім және ғылым қызметкерлері",
    text: "Курстар тәрбиешілер мен зерттеушілерге халықаралық білім беру жобаларына қатысуға және жаһандық деңгейде тәжірибе алмасуға мүмкіндік береді.",
    icon: faFlask,
    iconColor: "#E42125",
    bgColor: "#FAD3D3"
  },
  {
    title: "Маркетологтар мен жарнама мамандары",
    text: "Қазақ тілі арқылы кәсіби ағылшын тілін үйрену мақсатты аудиторияға туған тілдік ерекшеліктерін көрсете отырып, әлемдік нарықта өнімдер мен қызметтерді тиімді таныстыруға мүмкіндік береді.",
    icon: faLightbulb,
    iconColor: "#FFB800",
    bgColor: "#FFF1CC"
  },
  {
    title: "Медицина мамандары",
    text: "Кәсіби курстар дәрігерлер мен медбикелерге қажетті лексика мен терминологияны қамтамасыз етеміз, бұл көпұлтты медициналық ортада тиімді өзара әрекеттесудің кепілдігі.",
    icon: faUserDoctor,
    iconColor: "#3E98D4",
    bgColor: "#D5E9F6"
  }
];