import { IFaq } from "./types";

export const faqQuestions: IFaq[] = [
  {
    question: "Қосылу алдында курсты тексеру мүмкіндігі бар ма?",
    answer:
      "Иә, біз сіздің сатып алуыңызға дейін жүйелік сынаққа қол жеткізу мерзімін қамтамасыз етеміз. Оқыту жүйесін, мазмұнын және әдістемесін бағалау үшін біз тегін демонстрациялық сабақтар мен материалдарды ұсынамыз. Бұл тарифтерді қоспас бұрын шешім қабылдауға мүмкіндік береді.",
  },
  {
    question:
      "Курстар қанша уақытқа созылады және оқу қарқынын реттеуге бола ма?",
    answer:
      "Курстардың уақыттық сапасы курстың мазмұнына және кестеушінің талаптарына байланысты. Оқу қарқынын реттеуге болады, себебі біз оқыту процесінің деңгейін және талаптарын ұстанамыз.",
  },
  {
    question:
      "Оқу кезінде қандай қолдау және кері байланыс мүмкіндіктері беріледі?",
    answer:
      "Оқу кезінде, сізге курстағы мұғалімдермен және оқыту құралдарымен байланысты қолдау беріледі. Сіз курстағы форумдарда сұрақтарыңызды және көмек керек болатын жағдайларды қоя аласыз.",
  },
  {
    question: "Курстың бағасына қандай ресурстар мен материалдар кіреді?",
    answer:
      "Курстың бағасына сізге оқу үшін керек болатын барлық материалдар кіреді. Бұл оқу кітаптары, онлайн сабақтар, жинақтар, жобалар мен басқа материалдардан тұрады. Мұғалімдер сізге оқуды жаңа технологиялармен, интерактивті әдістемелермен және қызметтермен ұсынады.",
  },
  {
    question:
      "Оқыту сапасына кепілдік бар ма және қандай нәтиже күтуге болады?",
    answer:
      "Иә, біз оқыту сапасына кепілдік береміз. Мұғалімдеріміз профессионалдық білімге, жаңа технологияларға және оқыту әдістемелеріне қолдау көрсетеді. Сондықтан, сіз курсты аяқтағаннан кейін, сапаның бағаларымен келесі жаңа білімдер мен қабілеттерді кезіңіздің бейіндегі жағдайға қатынасуға болады.",
  },
];